Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
le.sbeacon.data.aws_iam_policy_document.lambda-getGenomicVariants: Read complete after 0s [id=2351733893]
module.sbeacon.module.lambda-getAnalyses.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-getAnalyses:sbeacon-backend-getAnalyses-0]
module.sbeacon.module.lambda-getAnalyses.aws_iam_role_policy.additional_jsons[2]: Refreshing state... [id=sbeacon-backend-getAnalyses:sbeacon-backend-getAnalyses-2]
module.sbeacon.module.lambda-getAnalyses.aws_iam_role_policy.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-getAnalyses:sbeacon-backend-getAnalyses-1]
module.sbeacon.module.lambda-getAnalyses.aws_iam_role_policy.additional_jsons[3]: Refreshing state... [id=sbeacon-backend-getAnalyses:sbeacon-backend-getAnalyses-3]
module.sbeacon.module.lambda-getIndividuals.aws_iam_role_policy.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-getIndividuals:sbeacon-backend-getIndividuals-1]
module.sbeacon.module.lambda-getIndividuals.aws_iam_role_policy.additional_jsons[3]: Refreshing state... [id=sbeacon-backend-getIndividuals:sbeacon-backend-getIndividuals-3]
module.sbeacon.module.lambda-getIndividuals.aws_iam_role_policy.additional_jsons[2]: Refreshing state... [id=sbeacon-backend-getIndividuals:sbeacon-backend-getIndividuals-2]
module.sbeacon.module.lambda-getIndividuals.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-getIndividuals:sbeacon-backend-getIndividuals-0]
module.sbeacon.module.lambda-getBiosamples.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-getBiosamples:sbeacon-backend-getBiosamples-0]
module.sbeacon.module.lambda-getBiosamples.aws_iam_role_policy.additional_jsons[2]: Refreshing state... [id=sbeacon-backend-getBiosamples:sbeacon-backend-getBiosamples-2]
module.sbeacon.module.lambda-getBiosamples.aws_iam_role_policy.additional_jsons[3]: Refreshing state... [id=sbeacon-backend-getBiosamples:sbeacon-backend-getBiosamples-3]
module.sbeacon.module.lambda-getBiosamples.aws_iam_role_policy.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-getBiosamples:sbeacon-backend-getBiosamples-1]
module.sbeacon.module.lambda-getRuns.aws_iam_role_policy.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-getRuns:sbeacon-backend-getRuns-1]
module.sbeacon.module.lambda-getRuns.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-getRuns:sbeacon-backend-getRuns-0]
module.sbeacon.module.lambda-getRuns.aws_iam_role_policy.additional_jsons[2]: Refreshing state... [id=sbeacon-backend-getRuns:sbeacon-backend-getRuns-2]
module.sbeacon.module.lambda-getRuns.aws_iam_role_policy.additional_jsons[3]: Refreshing state... [id=sbeacon-backend-getRuns:sbeacon-backend-getRuns-3]
module.sbeacon.module.lambda-getDatasets.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-getDatasets:sbeacon-backend-getDatasets-0]
module.sbeacon.module.lambda-getDatasets.aws_iam_role_policy.additional_jsons[2]: Refreshing state... [id=sbeacon-backend-getDatasets:sbeacon-backend-getDatasets-2]
module.sbeacon.module.lambda-getDatasets.aws_iam_role_policy.additional_jsons[3]: Refreshing state... [id=sbeacon-backend-getDatasets:sbeacon-backend-getDatasets-3]
module.sbeacon.module.lambda-getDatasets.aws_iam_role_policy.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-getDatasets:sbeacon-backend-getDatasets-1]
module.sbeacon.module.lambda-getGenomicVariants.aws_iam_role_policy.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-getGenomicVariants:sbeacon-backend-getGenomicVariants-1]
module.sbeacon.module.lambda-getGenomicVariants.aws_iam_role_policy.additional_jsons[2]: Refreshing state... [id=sbeacon-backend-getGenomicVariants:sbeacon-backend-getGenomicVariants-2]
module.sbeacon.module.lambda-getGenomicVariants.aws_iam_role_policy.additional_jsons[3]: Refreshing state... [id=sbeacon-backend-getGenomicVariants:sbeacon-backend-getGenomicVariants-3]
module.sbeacon.module.lambda-getGenomicVariants.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-getGenomicVariants:sbeacon-backend-getGenomicVariants-0]
module.sbeacon.module.lambda-getAnalyses.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getAnalyses]
module.sbeacon.module.lambda-getIndividuals.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getIndividuals]
module.sbeacon.module.lambda-getBiosamples.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getBiosamples]
module.sbeacon.module.lambda-getRuns.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getRuns]
module.sbeacon.module.lambda-getDatasets.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getDatasets]
module.sbeacon.aws_lambda_permission.APIdportal_proxy: Refreshing state... [id=AllowAPIdportal_proxyInvoke]
module.sbeacon.aws_api_gateway_integration.dportal_proxy: Refreshing state... [id=agi-v762unlmie-9axqx3-ANY]
module.sbeacon.module.lambda-getGenomicVariants.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getGenomicVariants]
module.sbeacon.aws_api_gateway_integration_response.dportal_proxy: Refreshing state... [id=agir-v762unlmie-9axqx3-ANY-200]
module.sbeacon.aws_lambda_permission.APIindividualsIdg_variants: Refreshing state... [id=AllowAPIindividualsIdg_variantsInvoke]
module.sbeacon.aws_lambda_permission.APIindividuals: Refreshing state... [id=AllowAPIindividualsInvoke]
module.sbeacon.aws_lambda_permission.APIindividualsId: Refreshing state... [id=AllowAPIindividualsIdInvoke]
module.sbeacon.aws_lambda_permission.APIindividualsIdbiosamples: Refreshing state... [id=AllowAPIindividualsIdbiosamplesInvoke]
module.sbeacon.aws_lambda_permission.APIindividualsFilteringTerms: Refreshing state... [id=AllowAPIindividualsFilteringTermsInvoke]
module.sbeacon.aws_api_gateway_integration.individuals_post: Refreshing state... [id=agi-v762unlmie-oftg7w-POST]
module.sbeacon.aws_api_gateway_integration.individuals-id-g_variants: Refreshing state... [id=agi-v762unlmie-keddks-GET]
module.sbeacon.aws_api_gateway_integration.individuals-id-biosamples: Refreshing state... [id=agi-v762unlmie-s5128d-GET]
module.sbeacon.aws_api_gateway_integration.individuals-filtering_terms_post: Refreshing state... [id=agi-v762unlmie-ushf3y-POST]
module.sbeacon.aws_api_gateway_integration.individuals-id: Refreshing state... [id=agi-v762unlmie-zf02l6-GET]
module.sbeacon.aws_api_gateway_integration.individuals-filtering_terms: Refreshing state... [id=agi-v762unlmie-ushf3y-GET]
module.sbeacon.aws_api_gateway_integration.individuals-id-g_variants_post: Refreshing state... [id=agi-v762unlmie-keddks-POST]
module.sbeacon.aws_api_gateway_integration.individuals: Refreshing state... [id=agi-v762unlmie-oftg7w-GET]
module.sbeacon.aws_api_gateway_integration.individuals-id-biosamples_post: Refreshing state... [id=agi-v762unlmie-s5128d-POST]
module.sbeacon.aws_api_gateway_integration.analyses-id-g_variants: Refreshing state... [id=agi-v762unlmie-dl7fdc-GET]
module.sbeacon.aws_api_gateway_integration.analyses-id_post: Refreshing state... [id=agi-v762unlmie-4v9wtn-POST]
module.sbeacon.aws_api_gateway_integration.analyses-id: Refreshing state... [id=agi-v762unlmie-4v9wtn-GET]
module.sbeacon.aws_api_gateway_integration.analyses_post: Refreshing state... [id=agi-v762unlmie-c6hkxf-POST]
module.sbeacon.aws_api_gateway_integration.analyses: Refreshing state... [id=agi-v762unlmie-c6hkxf-GET]
module.sbeacon.aws_api_gateway_integration.analyses-filtering_terms: Refreshing state... [id=agi-v762unlmie-39tvlf-GET]
module.sbeacon.aws_lambda_permission.APIanalyses: Refreshing state... [id=AllowAPIanalysesInvoke]
module.sbeacon.aws_lambda_permission.APIanalysesFilteringTerms: Refreshing state... [id=AllowAPIanalysesFilteringTermsInvoke]
module.sbeacon.aws_lambda_permission.APIanalysesIdg_variants: Refreshing state... [id=AllowAPIanalysesIdg_variantsInvoke]
module.sbeacon.aws_lambda_permission.APIanalysesId: Refreshing state... [id=AllowAPIanalysesIdInvoke]
module.sbeacon.aws_api_gateway_integration.analyses-id-g_variants_post: Refreshing state... [id=agi-v762unlmie-dl7fdc-POST]
module.sbeacon.aws_api_gateway_integration.analyses-filtering_terms_post: Refreshing state... [id=agi-v762unlmie-39tvlf-POST]
module.sbeacon.aws_api_gateway_integration_response.individuals_post: Refreshing state... [id=agir-v762unlmie-oftg7w-POST-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id-biosamples: Refreshing state... [id=agir-v762unlmie-s5128d-GET-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-filtering_terms_post: Refreshing state... [id=agir-v762unlmie-ushf3y-POST-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id-g_variants: Refreshing state... [id=agir-v762unlmie-keddks-GET-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id: Refreshing state... [id=agir-v762unlmie-zf02l6-GET-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-filtering_terms: Refreshing state... [id=agir-v762unlmie-ushf3y-GET-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id-g_variants_post: Refreshing state... [id=agir-v762unlmie-keddks-POST-200]
module.sbeacon.aws_api_gateway_integration_response.individuals: Refreshing state... [id=agir-v762unlmie-oftg7w-GET-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id-biosamples_post: Refreshing state... [id=agir-v762unlmie-s5128d-POST-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-id-g_variants: Refreshing state... [id=agir-v762unlmie-dl7fdc-GET-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-id_post: Refreshing state... [id=agir-v762unlmie-4v9wtn-POST-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-id: Refreshing state... [id=agir-v762unlmie-4v9wtn-GET-200]
module.sbeacon.aws_api_gateway_integration_response.analyses_post: Refreshing state... [id=agir-v762unlmie-c6hkxf-POST-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-filtering_terms: Refreshing state... [id=agir-v762unlmie-39tvlf-GET-200]
module.sbeacon.aws_lambda_permission.APIdatasetsId: Refreshing state... [id=AllowAPIdatasetsIdInvoke]
module.sbeacon.aws_lambda_permission.APIdatasetsFilteringTerms: Refreshing state... [id=AllowAPIdatasetsFilteringTermsInvoke]
module.sbeacon.aws_lambda_permission.APIdatasetsIdindividuals: Refreshing state... [id=AllowAPIdatasetsIdindividualsInvoke]
module.sbeacon.aws_lambda_permission.APIdatasetsIdbiosamples: Refreshing state... [id=AllowAPIdatasetsIdbiosamplesInvoke]
module.sbeacon.aws_lambda_permission.APIdatasetsIdg_variants: Refreshing state... [id=AllowAPIdatasetsIdg_variantsInvoke]
module.sbeacon.aws_lambda_permission.APIdatasetsIdfiltering_terms: Refreshing state... [id=AllowAPIdatasetsIdfiltering_termsInvoke]
module.sbeacon.aws_lambda_permission.APIdatasets: Refreshing state... [id=AllowAPIdatasetsInvoke]
module.sbeacon.aws_api_gateway_integration.datasets-id-individuals_post: Refreshing state... [id=agi-v762unlmie-1lyw8p-POST]
module.sbeacon.aws_api_gateway_integration.datasets-id: Refreshing state... [id=agi-v762unlmie-9xvb5z-GET]
module.sbeacon.aws_api_gateway_integration.datasets-id-g_variants_post: Refreshing state... [id=agi-v762unlmie-f2n5b0-POST]
module.sbeacon.aws_api_gateway_integration.datasets-filtering_terms_post: Refreshing state... [id=agi-v762unlmie-w1wby7-POST]
module.sbeacon.aws_api_gateway_integration.datasets-id-g_variants: Refreshing state... [id=agi-v762unlmie-f2n5b0-GET]
module.sbeacon.aws_api_gateway_integration.datasets-id-filtering_terms: Refreshing state... [id=agi-v762unlmie-792vzj-GET]
module.sbeacon.aws_api_gateway_integration.datasets_post: Refreshing state... [id=agi-v762unlmie-qtucp9-POST]
module.sbeacon.aws_api_gateway_integration.datasets-id_post: Refreshing state... [id=agi-v762unlmie-9xvb5z-POST]
module.sbeacon.aws_api_gateway_integration.datasets: Refreshing state... [id=agi-v762unlmie-qtucp9-GET]
module.sbeacon.aws_api_gateway_integration.datasets-id-biosamples_post: Refreshing state... [id=agi-v762unlmie-mtxjxl-POST]
module.sbeacon.aws_api_gateway_integration.datasets-id-filtering_terms_post: Refreshing state... [id=agi-v762unlmie-792vzj-POST]
module.sbeacon.aws_api_gateway_integration.datasets-id-individuals: Refreshing state... [id=agi-v762unlmie-1lyw8p-GET]
module.sbeacon.aws_api_gateway_integration.datasets-filtering_terms: Refreshing state... [id=agi-v762unlmie-w1wby7-GET]
module.sbeacon.aws_api_gateway_integration.datasets-id-biosamples: Refreshing state... [id=agi-v762unlmie-mtxjxl-GET]
module.sbeacon.aws_api_gateway_integration_response.analyses: Refreshing state... [id=agir-v762unlmie-c6hkxf-GET-200]
module.sbeacon.aws_api_gateway_integration.biosamples-filtering_terms_post: Refreshing state... [id=agi-v762unlmie-csbk6t-POST]
module.sbeacon.aws_api_gateway_integration.biosamples-filtering_terms: Refreshing state... [id=agi-v762unlmie-csbk6t-GET]
module.sbeacon.aws_lambda_permission.APIbiosamplesIdanalyses: Refreshing state... [id=AllowAPIbiosamplesIdanalysesInvoke]
module.sbeacon.aws_api_gateway_integration.biosamples-id_post: Refreshing state... [id=agi-v762unlmie-t0ywlh-POST]
module.sbeacon.aws_api_gateway_integration.biosamples_post: Refreshing state... [id=agi-v762unlmie-9si70o-POST]
module.sbeacon.aws_api_gateway_integration.biosamples-id-g_variants: Refreshing state... [id=agi-v762unlmie-5l41w9-GET]
module.sbeacon.aws_api_gateway_integration.biosamples-id-analyses_post: Refreshing state... [id=agi-v762unlmie-85ixzl-POST]
module.sbeacon.aws_api_gateway_integration.biosamples-id-runs: Refreshing state... [id=agi-v762unlmie-e3nia7-GET]
module.sbeacon.aws_api_gateway_integration.biosamples-id-g_variants_post: Refreshing state... [id=agi-v762unlmie-5l41w9-POST]
module.sbeacon.aws_api_gateway_integration.biosamples-id-analyses: Refreshing state... [id=agi-v762unlmie-85ixzl-GET]
module.sbeacon.aws_api_gateway_integration.biosamples-id-runs_post: Refreshing state... [id=agi-v762unlmie-e3nia7-POST]
module.sbeacon.aws_api_gateway_integration.biosamples: Refreshing state... [id=agi-v762unlmie-9si70o-GET]
module.sbeacon.aws_lambda_permission.APIbiosamplesIdg_variants: Refreshing state... [id=AllowAPIbiosamplesIdg_variantsInvoke]
module.sbeacon.aws_lambda_permission.APIbiosamples: Refreshing state... [id=AllowAPIbiosamplesInvoke]
module.sbeacon.aws_lambda_permission.APIbiosamplesId: Refreshing state... [id=AllowAPIbiosamplesIdInvoke]
module.sbeacon.aws_lambda_permission.APIbiosamplesIdruns: Refreshing state... [id=AllowAPIbiosamplesIdrunsInvoke]
module.sbeacon.aws_lambda_permission.APIbiosamplesFilteringTerms: Refreshing state... [id=AllowAPIbiosamplesFilteringTermsInvoke]
module.sbeacon.aws_lambda_permission.APIrunsFilteringTerms: Refreshing state... [id=AllowAPIrunsFilteringTermsInvoke]
module.sbeacon.aws_api_gateway_integration.runs: Refreshing state... [id=agi-v762unlmie-ayp129-GET]
module.sbeacon.aws_api_gateway_integration.runs-id-analyses_post: Refreshing state... [id=agi-v762unlmie-qtdi1n-POST]
module.sbeacon.aws_api_gateway_integration.g_variants: Refreshing state... [id=agi-v762unlmie-fpksft-GET]
module.sbeacon.aws_lambda_permission.APIrunsId: Refreshing state... [id=AllowAPIrunsIdInvoke]
module.sbeacon.aws_lambda_permission.APIrunsIdanalyses: Refreshing state... [id=AllowAPIrunsIdanalysesInvoke]
module.sbeacon.aws_api_gateway_integration.runs-filtering_terms: Refreshing state... [id=agi-v762unlmie-e3975s-GET]
module.sbeacon.aws_lambda_permission.APIrunsIdg_variants: Refreshing state... [id=AllowAPIrunsIdg_variantsInvoke]
module.sbeacon.aws_api_gateway_integration.runs-id-g_variants_post: Refreshing state... [id=agi-v762unlmie-abo0y5-POST]
module.sbeacon.aws_api_gateway_integration.runs-id_post: Refreshing state... [id=agi-v762unlmie-ybyrl8-POST]
module.sbeacon.aws_api_gateway_integration.g_variants-id: Refreshing state... [id=agi-v762unlmie-jx2hyi-GET]
module.sbeacon.aws_api_gateway_integration.g_variants_post: Refreshing state... [id=agi-v762unlmie-fpksft-POST]
module.sbeacon.aws_api_gateway_integration.runs-filtering_terms_post: Refreshing state... [id=agi-v762unlmie-e3975s-POST]
module.sbeacon.aws_lambda_permission.APIruns: Refreshing state... [id=AllowAPIrunsInvoke]
module.sbeacon.aws_api_gateway_integration_response.analyses-filtering_terms_post: Refreshing state... [id=agir-v762unlmie-39tvlf-POST-200]
module.sbeacon.aws_api_gateway_integration.g_variants-id-biosamples_post: Refreshing state... [id=agi-v762unlmie-q7yacr-POST]
module.sbeacon.aws_api_gateway_integration.g_variants-id-individuals_post: Refreshing state... [id=agi-v762unlmie-w3i82v-POST]
module.sbeacon.aws_api_gateway_integration.g_variants-id_post: Refreshing state... [id=agi-v762unlmie-jx2hyi-POST]
module.sbeacon.aws_api_gateway_integration.g_variants-id-biosamples: Refreshing state... [id=agi-v762unlmie-q7yacr-GET]
module.sbeacon.aws_api_gateway_integration.g_variants-id-individuals: Refreshing state... [id=agi-v762unlmie-w3i82v-GET]
module.sbeacon.aws_api_gateway_integration.runs_post: Refreshing state... [id=agi-v762unlmie-ayp129-POST]
module.sbeacon.aws_api_gateway_integration_response.analyses-id-g_variants_post: Refreshing state... [id=agir-v762unlmie-dl7fdc-POST-200]
module.sbeacon.aws_api_gateway_integration.runs-id-analyses: Refreshing state... [id=agi-v762unlmie-qtdi1n-GET]
module.sbeacon.aws_api_gateway_integration.runs-id-g_variants: Refreshing state... [id=agi-v762unlmie-abo0y5-GET]
module.sbeacon.aws_api_gateway_integration.runs-id: Refreshing state... [id=agi-v762unlmie-ybyrl8-GET]
module.sbeacon.aws_lambda_permission.APIg_variantsId: Refreshing state... [id=AllowAPIg_variantsIdInvoke]
module.sbeacon.aws_lambda_permission.APIg_variantsIdbiosamples: Refreshing state... [id=AllowAPIg_variantsIdbiosamplesInvoke]
module.sbeacon.aws_lambda_permission.APIg_variants: Refreshing state... [id=AllowAPIg_variantsInvoke]
module.sbeacon.aws_lambda_permission.APIg_variantsIdindividuals: Refreshing state... [id=AllowAPIg_variantsIdindividualsInvoke]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-individuals_post: Refreshing state... [id=agir-v762unlmie-1lyw8p-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-g_variants_post: Refreshing state... [id=agir-v762unlmie-f2n5b0-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-filtering_terms: Refreshing state... [id=agir-v762unlmie-792vzj-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-g_variants: Refreshing state... [id=agir-v762unlmie-f2n5b0-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets_post: Refreshing state... [id=agir-v762unlmie-qtucp9-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id_post: Refreshing state... [id=agir-v762unlmie-9xvb5z-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets: Refreshing state... [id=agir-v762unlmie-qtucp9-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-biosamples_post: Refreshing state... [id=agir-v762unlmie-mtxjxl-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-filtering_terms_post: Refreshing state... [id=agir-v762unlmie-792vzj-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-individuals: Refreshing state... [id=agir-v762unlmie-1lyw8p-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-filtering_terms: Refreshing state... [id=agir-v762unlmie-w1wby7-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-biosamples: Refreshing state... [id=agir-v762unlmie-mtxjxl-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-filtering_terms_post: Refreshing state... [id=agir-v762unlmie-csbk6t-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-filtering_terms: Refreshing state... [id=agir-v762unlmie-csbk6t-GET-200]
module.svep[0].aws_api_gateway_integration_response.submit-patch: Refreshing state... [id=agir-cgjp8s55wf-qwb1zh-PATCH-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id_post: Refreshing state... [id=agir-v762unlmie-t0ywlh-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples_post: Refreshing state... [id=agir-v762unlmie-9si70o-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-analyses_post: Refreshing state... [id=agir-v762unlmie-85ixzl-POST-200]
module.sbeacon.aws_api_gateway_integration.individuals-id_post: Refreshing state... [id=agi-v762unlmie-zf02l6-POST]
module.sbeacon.aws_api_gateway_method_response.individuals-id_post: Refreshing state... [id=agmr-v762unlmie-zf02l6-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-g_variants: Refreshing state... [id=agir-v762unlmie-5l41w9-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id: Refreshing state... [id=agir-v762unlmie-9xvb5z-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-runs_post: Refreshing state... [id=agir-v762unlmie-e3nia7-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples: Refreshing state... [id=agir-v762unlmie-9si70o-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs: Refreshing state... [id=agir-v762unlmie-ayp129-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id-analyses_post: Refreshing state... [id=agir-v762unlmie-qtdi1n-POST-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants: Refreshing state... [id=agir-v762unlmie-fpksft-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs-filtering_terms: Refreshing state... [id=agir-v762unlmie-e3975s-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-runs: Refreshing state... [id=agir-v762unlmie-e3nia7-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id-g_variants_post: Refreshing state... [id=agir-v762unlmie-abo0y5-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id_post: Refreshing state... [id=agir-v762unlmie-ybyrl8-POST-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id: Refreshing state... [id=agir-v762unlmie-jx2hyi-GET-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants_post: Refreshing state... [id=agir-v762unlmie-fpksft-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs-filtering_terms_post: Refreshing state... [id=agir-v762unlmie-e3975s-POST-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id-biosamples_post: Refreshing state... [id=agir-v762unlmie-q7yacr-POST-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id-individuals_post: Refreshing state... [id=agir-v762unlmie-w3i82v-POST-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id_post: Refreshing state... [id=agir-v762unlmie-jx2hyi-POST-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id-biosamples: Refreshing state... [id=agir-v762unlmie-q7yacr-GET-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id-individuals: Refreshing state... [id=agir-v762unlmie-w3i82v-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs_post: Refreshing state... [id=agir-v762unlmie-ayp129-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id-analyses: Refreshing state... [id=agir-v762unlmie-qtdi1n-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id: Refreshing state... [id=agir-v762unlmie-ybyrl8-GET-200]
module.svep[0].aws_api_gateway_deployment.VPApi: Refreshing state... [id=bel6ub]
module.sbeacon.aws_api_gateway_integration_response.individuals-id_post: Refreshing state... [id=agir-v762unlmie-zf02l6-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-g_variants_post: Refreshing state... [id=agir-v762unlmie-5l41w9-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id-g_variants: Refreshing state... [id=agir-v762unlmie-abo0y5-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-filtering_terms_post: Refreshing state... [id=agir-v762unlmie-w1wby7-POST-200]
module.svep[0].aws_api_gateway_stage.VPApi: Refreshing state... [id=ags-cgjp8s55wf-prod]
module.svep[0].aws_api_gateway_method_settings.VPApi: Refreshing state... [id=cgjp8s55wf-prod-*/*]
module.svep[0].aws_cloudfront_distribution.api_distribution: Refreshing state... [id=E3KNV7RH93FYNK]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-analyses: Refreshing state... [id=agir-v762unlmie-85ixzl-GET-200]
module.sbeacon.aws_api_gateway_method_response.biosamples-id: Refreshing state... [id=agmr-v762unlmie-t0ywlh-GET-200]
module.sbeacon.aws_api_gateway_integration.biosamples-id: Refreshing state... [id=agi-v762unlmie-t0ywlh-GET]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id: Refreshing state... [id=agir-v762unlmie-t0ywlh-GET-200]
module.sbeacon.aws_api_gateway_deployment.BeaconApi: Refreshing state... [id=53rclu]
module.sbeacon.aws_api_gateway_stage.BeaconApi: Refreshing state... [id=ags-v762unlmie-prod]
module.sbeacon.aws_api_gateway_method_settings.BeaconApi: Refreshing state... [id=v762unlmie-prod-*/*]
module.sbeacon.aws_cloudfront_distribution.api_distribution: Refreshing state... [id=E36BECILCZSHX1]
module.webgui.data.external.build: Reading...
module.webgui.aws_cloudfront_response_headers_policy.bui-security-headers-policy: Refreshing state... [id=25220f86-1793-478b-ac6e-11025780f011]
module.webgui.aws_cloudfront_distribution.bui-s3-distribution: Refreshing state... [id=E1MIJT7J6L0XMY]
module.webgui.data.aws_iam_policy_document.s3_access_from_cloudfront: Reading...
module.webgui.data.aws_iam_policy_document.s3_access_from_cloudfront: Read complete after 0s [id=3845166351]
module.webgui.terraform_data.cloudfront-version-invalidate: Refreshing state... [id=742572fc-0329-0670-a216-42a15cafa032]
module.webgui.aws_ssm_parameter.bui-ssm-beacon-ui-url: Refreshing state... [id=bui-ssm-beacon-ui-url]
module.webgui.aws_s3_bucket_policy.s3_access_from_cloudfront: Refreshing state... [id=webgui-bucket-20250725041401948400000001]
module.webgui.data.external.build: Still reading... [10s elapsed]
module.webgui.data.external.build: Still reading... [20s elapsed]
module.webgui.data.external.build: Still reading... [30s elapsed]
module.webgui.data.external.build: Still reading... [40s elapsed]
module.webgui.data.external.build: Still reading... [50s elapsed]
module.webgui.data.external.build: Still reading... [1m0s elapsed]
module.webgui.data.external.build: Still reading... [1m10s elapsed]
module.webgui.data.external.build: Still reading... [1m20s elapsed]
module.webgui.data.external.build: Still reading... [1m30s elapsed]
module.webgui.data.external.build: Read complete after 1m31s [id=-]
module.webgui.null_resource.s3-upload: Refreshing state... [id=5552606194109423165]
module.webgui.null_resource.cloudfront-invalidate: Refreshing state... [id=1369275654522272403]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_image.this has been deleted
  - resource "docker_image" "this" {
        id           = "sha256:93c1ae5e23008706fddd9b5ec07f820a8bbf63ce626829cd4df3bf0991865ace307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers"
      - image_id     = "sha256:93c1ae5e23008706fddd9b5ec07f820a8bbf63ce626829cd4df3bf0991865ace" -> null
      - name         = "307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers" -> null
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.svep[0].module.docker_image_pluginConsequence_lambda.docker_image.this has been deleted
  - resource "docker_image" "this" {
        id           = "sha256:93dba14648082ff13d470990599207d9ad804faff48e53a4d737be9f6c29ba42307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers"
      - image_id     = "sha256:93dba14648082ff13d470990599207d9ad804faff48e53a4d737be9f6c29ba42" -> null
      - name         = "307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers" -> null
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.svep[0].module.docker_image_qcFigures_lambda.docker_image.this has been deleted
  - resource "docker_image" "this" {
        id           = "sha256:57adbd6145804609511ef1a79926c2c0caa5863f38382a49b8d3f0be44fee74d307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers"
      - image_id     = "sha256:57adbd6145804609511ef1a79926c2c0caa5863f38382a49b8d3f0be44fee74d" -> null
      - name         = "307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers" -> null
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.sbeacon.aws_glue_catalog_table.sbeacon-analyses will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-analyses" {
        id                 = "307946671795:sbeacon_metadata:sbeacon_analyses"
        name               = "sbeacon_analyses"
      - owner              = "307946671795" -> null
      ~ parameters         = {
          - "auto.purge"         = "false" -> null
          - "bucketing_format"   = "hive" -> null
          - "bucketing_version"  = "1" -> null
          - "has_encrypted_data" = "false" -> null
          - "numFiles"           = "-1" -> null
          - "presto_query_id"    = "20250822_092308_00039_cgmtb" -> null
          - "presto_version"     = "0.215-24159-g256e5cb" -> null
          - "totalSize"          = "-1" -> null
          - "transactional"      = "false" -> null
            # (2 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)

      ~ storage_descriptor {
          ~ bucket_columns            = [
              - "id",
              - "_datasetid",
            ]
          ~ location                  = "s3://gaspi-metadata-20250725041403343200000002/analyses/" -> "s3://gaspi-metadata-20250725041403343200000002/analyses"
          - number_of_buckets         = 50 -> null
            # (6 unchanged attributes hidden)

          ~ ser_de_info {
              + name                  = "ORC"
              ~ parameters            = {
                  + "hive.orc.use-column-names" = "TRUE"
                  + "orc.column.index.access"   = "FALSE"
                  + "serialization.format"      = "1"
                }
                # (1 unchanged attribute hidden)
            }

            # (13 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-biosamples will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-biosamples" {
        id                 = "307946671795:sbeacon_metadata:sbeacon_biosamples"
        name               = "sbeacon_biosamples"
      - owner              = "307946671795" -> null
      ~ parameters         = {
          - "auto.purge"         = "false" -> null
          - "bucketing_format"   = "hive" -> null
          - "bucketing_version"  = "1" -> null
          - "has_encrypted_data" = "false" -> null
          - "numFiles"           = "-1" -> null
          - "presto_query_id"    = "20250822_092308_00111_mkz2u" -> null
          - "presto_version"     = "0.215-24159-g256e5cb" -> null
          - "totalSize"          = "-1" -> null
          - "transactional"      = "false" -> null
            # (2 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)

      ~ storage_descriptor {
          ~ bucket_columns            = [
              - "id",
              - "_datasetid",
            ]
          ~ location                  = "s3://gaspi-metadata-20250725041403343200000002/biosamples/" -> "s3://gaspi-metadata-20250725041403343200000002/biosamples"
          - number_of_buckets         = 50 -> null
            # (6 unchanged attributes hidden)

          ~ ser_de_info {
              + name                  = "ORC"
              ~ parameters            = {
                  + "hive.orc.use-column-names" = "TRUE"
                  + "orc.column.index.access"   = "FALSE"
                  + "serialization.format"      = "1"
                }
                # (1 unchanged attribute hidden)
            }

            # (22 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-datasets will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-datasets" {
        id                 = "307946671795:sbeacon_metadata:sbeacon_datasets"
        name               = "sbeacon_datasets"
      - owner              = "307946671795" -> null
      ~ parameters         = {
          - "auto.purge"         = "false" -> null
          - "bucketing_format"   = "hive" -> null
          - "bucketing_version"  = "1" -> null
          - "has_encrypted_data" = "false" -> null
          - "numFiles"           = "-1" -> null
          - "presto_query_id"    = "20250822_092307_00023_8q449" -> null
          - "presto_version"     = "0.215-24159-g256e5cb" -> null
          - "totalSize"          = "-1" -> null
          - "transactional"      = "false" -> null
            # (2 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)

      ~ storage_descriptor {
          ~ bucket_columns            = [
              - "id",
              - "_assemblyid",
            ]
          ~ location                  = "s3://gaspi-metadata-20250725041403343200000002/datasets/" -> "s3://gaspi-metadata-20250725041403343200000002/datasets"
          - number_of_buckets         = 10 -> null
            # (6 unchanged attributes hidden)

          ~ ser_de_info {
              + name                  = "ORC"
              ~ parameters            = {
                  + "hive.orc.use-column-names" = "TRUE"
                  + "orc.column.index.access"   = "FALSE"
                  + "serialization.format"      = "1"
                }
                # (1 unchanged attribute hidden)
            }

            # (14 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-individuals will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-individuals" {
        id                 = "307946671795:sbeacon_metadata:sbeacon_individuals"
        name               = "sbeacon_individuals"
      - owner              = "307946671795" -> null
      ~ parameters         = {
          - "auto.purge"         = "false" -> null
          - "bucketing_format"   = "hive" -> null
          - "bucketing_version"  = "1" -> null
          - "has_encrypted_data" = "false" -> null
          - "numFiles"           = "-1" -> null
          - "presto_query_id"    = "20250822_092308_00151_p52b7" -> null
          - "presto_version"     = "0.215-24159-g256e5cb" -> null
          - "totalSize"          = "-1" -> null
          - "transactional"      = "false" -> null
            # (2 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)

      ~ storage_descriptor {
          ~ bucket_columns            = [
              - "id",
              - "_datasetid",
            ]
          ~ location                  = "s3://gaspi-metadata-20250725041403343200000002/individuals/" -> "s3://gaspi-metadata-20250725041403343200000002/individuals"
          - number_of_buckets         = 50 -> null
            # (6 unchanged attributes hidden)

          ~ ser_de_info {
              + name                  = "ORC"
              ~ parameters            = {
                  + "hive.orc.use-column-names" = "TRUE"
                  + "orc.column.index.access"   = "FALSE"
                  + "serialization.format"      = "1"
                }
                # (1 unchanged attribute hidden)
            }

            # (15 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-relations will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-relations" {
        id                 = "307946671795:sbeacon_metadata:sbeacon_relations"
        name               = "sbeacon_relations"
      - owner              = "307946671795" -> null
      ~ parameters         = {
          - "auto.purge"         = "false" -> null
          - "bucketing_format"   = "hive" -> null
          - "bucketing_version"  = "1" -> null
          - "has_encrypted_data" = "false" -> null
          - "numFiles"           = "-1" -> null
          - "presto_query_id"    = "20250822_092314_00015_23bsb" -> null
          - "presto_version"     = "0.215-24159-g256e5cb" -> null
          - "totalSize"          = "-1" -> null
          - "transactional"      = "false" -> null
            # (2 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)

      ~ storage_descriptor {
          ~ bucket_columns            = [
              - "individualid",
              - "biosampleid",
              - "runid",
              - "analysisid",
            ]
          ~ location                  = "s3://gaspi-metadata-20250725041403343200000002/relations/" -> "s3://gaspi-metadata-20250725041403343200000002/relations"
          - number_of_buckets         = 50 -> null
            # (6 unchanged attributes hidden)

          ~ ser_de_info {
              + name                  = "ORC"
              ~ parameters            = {
                  + "hive.orc.use-column-names" = "TRUE"
                  + "orc.column.index.access"   = "FALSE"
                  + "serialization.format"      = "1"
                }
                # (1 unchanged attribute hidden)
            }

            # (5 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-runs will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-runs" {
        id                 = "307946671795:sbeacon_metadata:sbeacon_runs"
        name               = "sbeacon_runs"
      - owner              = "307946671795" -> null
      ~ parameters         = {
          - "auto.purge"         = "false" -> null
          - "bucketing_format"   = "hive" -> null
          - "bucketing_version"  = "1" -> null
          - "has_encrypted_data" = "false" -> null
          - "numFiles"           = "-1" -> null
          - "presto_query_id"    = "20250822_092308_00007_23bsb" -> null
          - "presto_version"     = "0.215-24159-g256e5cb" -> null
          - "totalSize"          = "-1" -> null
          - "transactional"      = "false" -> null
            # (2 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)

      ~ storage_descriptor {
          ~ bucket_columns            = [
              - "id",
              - "_datasetid",
            ]
          ~ location                  = "s3://gaspi-metadata-20250725041403343200000002/runs/" -> "s3://gaspi-metadata-20250725041403343200000002/runs"
          - number_of_buckets         = 50 -> null
            # (6 unchanged attributes hidden)

          ~ ser_de_info {
              + name                  = "ORC"
              ~ parameters            = {
                  + "hive.orc.use-column-names" = "TRUE"
                  + "orc.column.index.access"   = "FALSE"
                  + "serialization.format"      = "1"
                }
                # (1 unchanged attribute hidden)
            }

            # (13 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_lambda_layer_version.binaries_layer must be replaced
+/- resource "aws_lambda_layer_version" "binaries_layer" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_binaries_layer:57" -> (known after apply)
      ~ code_sha256                 = "hZ+AOOonQwgvm2kpl0HJNWLWk7UVyepcSeXPmKZB4fI=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-08-20T02:24:32.128+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_binaries_layer:57" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_binaries_layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "gQX7SyXr/VpTPHzhSNY5jetoT5zWnFfuBAn5QJ1fnKQfQdj1s7RVoPnYS5yLE6MueTqm6F4kaCyaAzzYbNVwFw==" -> "RhoLdYv+rnQxYCP0+zwIdci2Oau8JOJjKevqWBCxUsrK1a3EOgXW8AYIdFoCy9warRPwczltYIU3W1sdUuDAQA==" # forces replacement
      ~ source_code_size            = 18422858 -> (known after apply)
      ~ version                     = "57" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.aws_s3_bucket_notification.updateFiles will be updated in-place
  ~ resource "aws_s3_bucket_notification" "updateFiles" {
      ~ eventbridge = true -> false
        id          = "gaspi-dataportal-20250725041402702700000001"
        # (2 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.svep[0].aws_lambda_layer_version.binaries_layer must be replaced
+/- resource "aws_lambda_layer_version" "binaries_layer" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_binaries_layer:51" -> (known after apply)
      ~ code_sha256                 = "hfnia1wVwXc5/R+BoECWJ1iNyrLkCg4z90zVgJ164Sw=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-08-20T02:24:33.161+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_binaries_layer:51" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_binaries_layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "V9kfsyPYBHziqWPXjilKidtR6BgGI9ZvOPeZmiwrAAS1YMbZVhL+gqIt/rwWvk/iFXd0JN17vczEe56FFAJllA==" -> "njK9ZIkkJvyLqI5DhEw53bhbxwivz3bbwAq6mJ0LwR+MwLgO/PvuAiC/ajFnk8yshQcI6GEiATy99kO9YRosgQ==" # forces replacement
      ~ source_code_size            = 17951226 -> (known after apply)
      ~ version                     = "51" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.webgui.aws_s3_object.version will be updated in-place
  ~ resource "aws_s3_object" "version" {
      ~ content                       = "v1.1.0-42-g4cb4fa5+" -> "v1.1.0-51-g06dfcf72+"
        id                            = "webgui-bucket-20250725041401948400000001/version.txt"
        tags                          = {}
      + version_id                    = (known after apply)
        # (25 unchanged attributes hidden)
    }

  # module.webgui.null_resource.cloudfront-invalidate must be replaced
-/+ resource "null_resource" "cloudfront-invalidate" {
      ~ id       = "1369275654522272403" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "compiled_code_hash" = "3a83320118bbee814ac32152143025ea4ef4f3e3" -> "9e640d957a843c8d72e3f580bcd4684de505b2ab"
        }
    }

  # module.webgui.null_resource.s3-upload must be replaced
-/+ resource "null_resource" "s3-upload" {
      ~ id       = "5552606194109423165" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "compiled_code_hash" = "3a83320118bbee814ac32152143025ea4ef4f3e3" -> "9e640d957a843c8d72e3f580bcd4684de505b2ab"
            # (1 unchanged element hidden)
        }
    }

  # module.webgui.terraform_data.cloudfront-version-invalidate must be replaced
-/+ resource "terraform_data" "cloudfront-version-invalidate" {
      ~ id               = "742572fc-0329-0670-a216-42a15cafa032" -> (known after apply)
      ~ triggers_replace = [
          ~ "v1.1.0-42-g4cb4fa5+" -> "v1.1.0-51-g06dfcf72+",
        ]
    }

  # module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8777404279343153704" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1755656463580818000" -> "1756363991851457200"
            # (1 unchanged element hidden)
        }
    }

  # module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8264243345743567940" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1755656464448770000" -> "1756363991280891800"
            # (1 unchanged element hidden)
        }
    }

  # module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8271938231540369377" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1755656465935309000" -> "1756363992843502000"
            # (1 unchanged element hidden)
        }
    }

  # module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8701024600937205609" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1755656465864095000" -> "1756363990546138000"
            # (1 unchanged element hidden)
        }
    }

  # module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4683737684595968029" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1755656466166140000" -> "1756364001983382000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_image.this will be created
  + resource "docker_image" "this" {
      + force_remove = false
      + id           = (known after apply)
      + image_id     = (known after apply)
      + keep_locally = false
      + name         = "307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers"
      + repo_digest  = (known after apply)
      + triggers     = {
          + "dir_sha" = "2d0fc66b07970cab847cfb181c088f29a3a46f66"
        }

      + build {
          + build_args     = {
              + "SHARED_LAYER_PATH" = "sbeacon/shared_resources/python-modules/python/shared"
            }
          + cache_from     = []
          + context        = "sbeacon/lambda/submitDataset"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:a9b3c6703b1c64deddfc8aa8821ee6acb7c56d5fbe61082e550308ef283e59ec" -> (known after apply)
        name                 = "307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers"
      ~ sha256_digest        = "sha256:a9b3c6703b1c64deddfc8aa8821ee6acb7c56d5fbe61082e550308ef283e59ec" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "763e9fc07203ac2d014047654f71912e29c0794e" -> "2d0fc66b07970cab847cfb181c088f29a3a46f66"
        }
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-admin.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/85e3af68e92937634cdc7cceeb7f0a50080ad253d73917e2f8f4486b6636cabb.zip" -> "builds/3ec152f228ff83e85abc25ed403459f5af57fc4d10d6c369148bc9ea00d00e42.zip"
        id                             = "sbeacon-backend-admin"
      ~ last_modified                  = "2025-08-20T02:25:06.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:61",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:29",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-admin.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/admin",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/3ec152f228ff83e85abc25ed403459f5af57fc4d10d6c369148bc9ea00d00e42.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/3ec152f228ff83e85abc25ed403459f5af57fc4d10d6c369148bc9ea00d00e42.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-admin.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5783558521012456956" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/85e3af68e92937634cdc7cceeb7f0a50080ad253d73917e2f8f4486b6636cabb.zip" -> "builds/3ec152f228ff83e85abc25ed403459f5af57fc4d10d6c369148bc9ea00d00e42.zip"
          ~ "timestamp" = "1755656465333555000" -> "1756363990887871000"
        }
    }

  # module.sbeacon.module.lambda-data-portal.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/dbbdf468ab522ee6aeef72cdf8de45d80716d0e6f0ce050aa7d26266b494f429.zip" -> "builds/970a59fb9c6f5c6e964379615968a752409ce13ae6b6919518425c77212ab159.zip"
        id                             = "sbeacon-backend-dataPortal"
      ~ last_modified                  = "2025-08-20T02:25:26.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:61",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:29",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-data-portal.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "pip",
                          + "python3.12",
                          + "sbeacon/lambda/dataPortal/requirements.txt",
                          + null,
                          + null,
                        ],
                      + [
                          + "zip",
                          + "sbeacon/lambda/dataPortal",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/970a59fb9c6f5c6e964379615968a752409ce13ae6b6919518425c77212ab159.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/970a59fb9c6f5c6e964379615968a752409ce13ae6b6919518425c77212ab159.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-data-portal.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2291151824629293754" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/dbbdf468ab522ee6aeef72cdf8de45d80716d0e6f0ce050aa7d26266b494f429.zip" -> "builds/970a59fb9c6f5c6e964379615968a752409ce13ae6b6919518425c77212ab159.zip"
          ~ "timestamp" = "1755656464970263000" -> "1756363991757909000"
        }
    }

  # module.sbeacon.module.lambda-deidentifyFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-deidentifyFiles"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:61",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:29",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_binaries_layer:57",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "835070278144015041" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1755656465746891000" -> "1756363991442745000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-generateCohortVCfs"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:61",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:29",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_binaries_layer:57",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6724325679345949639" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1755656465980450000" -> "1756363990728920000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-generateReports.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8292631657930466561" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1755656466363234000" -> "1756363991265812000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getAnalyses.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getAnalyses"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:61",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:29",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2105472348233953384" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1755656466328941200" -> "1756363991021043000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getBiosamples.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getBiosamples"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:61",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:29",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8466248233733719724" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1755656465027200000" -> "1756363990472357000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getConfiguration.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getConfiguration"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:61",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:29",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3116557240783244187" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1755656465077883000" -> "1756363990559142200"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getDatasets.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/e16fc418825fd061685436e1f73eebc3d7fceed2e2fdd24f90e41993d81d919a.zip" -> "builds/3deb9cfb06a3801ad79f7f71a1584d85a319237e54853fc25a6dbffff32bfb89.zip"
        id                             = "sbeacon-backend-getDatasets"
      ~ last_modified                  = "2025-08-20T02:25:19.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:61",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:29",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getDatasets.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/getDatasets",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/3deb9cfb06a3801ad79f7f71a1584d85a319237e54853fc25a6dbffff32bfb89.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/3deb9cfb06a3801ad79f7f71a1584d85a319237e54853fc25a6dbffff32bfb89.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-getDatasets.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "581270784272219875" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/e16fc418825fd061685436e1f73eebc3d7fceed2e2fdd24f90e41993d81d919a.zip" -> "builds/3deb9cfb06a3801ad79f7f71a1584d85a319237e54853fc25a6dbffff32bfb89.zip"
          ~ "timestamp" = "1755656466062210000" -> "1756363990776835000"
        }
    }

  # module.sbeacon.module.lambda-getEntryTypes.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getEntryTypes"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:61",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:29",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2363717432981406271" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timesta
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.